//#include<stdio.h>
//
//int maze1[8][10] =
//{
//	1, 0, 1, 1, 1, 1, 1, 1, 1, 1,
//	0, 0, 0, 0, 0, 1, 1, 1, 1, 1,
//	1, 0, 1, 1, 0, 1, 1, 1, 1, 1,
//	1, 0, 1, 1, 0, 1, 1, 1, 1, 1,
//	1, 0, 1, 1, 0, 0, 0, 0, 1, 1,
//	1, 0, 0, 1, 1, 1, 1, 0, 1, 1,
//	1, 1, 1, 1, 1, 1, 1, 0, 1, 1,
//	1, 1, 1, 1, 1, 1, 1, 0, 1, 1
//};
//int f1[8][10]; //지나온 경로 담는 배열
//
//void find1(int i, int j)
//{
//	f1[i][j] = 1;
//	printf("(%d, %d)\n", i, j);
//	if (i == 7 && j == 7)
//	{
//		printf("FIND END\n");
//		i = 1;j=0;
//	}
//	
//	if (j + 1 < 10 && maze1[i][j + 1] != 1 && f1[i][j + 1] == 0)//오른쪽 탐색
//		find1(i, j + 1);
//	if (j - 1 >= 0 && maze1[i][j - 1] != 1 && f1[i][j - 1] == 0)//왼쪽 탐색
//		find1(i, j - 1);
//	if (i + 1 < 8 && maze1[i + 1][j] != 1 && f1[i + 1][j] == 0)//위쪽 탐색
//		find1(i + 1, j);
//	if (i - 1 >= 0 && maze1[i - 1][j] != 1 && f1[i - 1][j] == 0)//아래쪽 탐색
//		find1(i - 1, j);
//	if (i == 5 && j == 2)
//	{
//		printf("경로찾기 실패!\n");
//	}
//	if (i == 0 && j == 1)
//	{
//		printf("FIND END\n");
//	}
//	f1[i][j] = 0;
//}
//
//int main()
//{
//	printf("maze1 경로탐색시작\n");
//	find1(1, 0);//시작위치
//	printf("maze1 경로탐색종료");
//	return 0;
//}